openfoam-bridge/templates/pritchard-cascade-2d/0/alphat
FoamFile {version 2.0; format ascii; class volScalarField; object alphat;}
dimensions [1 -1 -1 0 0 0 0];
internalField uniform 0;
boundaryField { cyclicLow {type cyclic;} cyclicHigh {type cyclic;} spanLow {type empty;} spanHigh {type empty;} inlet {type calculated; value uniform 0;} outlet {type calculated; value uniform 0;} blade {type compressible::alphatWallFunction; Prt 0.85; value uniform 0;} }
